Tekla.Structures.Solid.Edge
The Edge class represents a single global edge in a solid.

Tekla.Structures.Solid.Edge.type
Type of the edge.

Tekla.Structures.Solid.Edge.startPoint
Start point of the edge.

Tekla.Structures.Solid.Edge.endPoint
End point of the edge.

Tekla.Structures.Solid.Edge.shellIndex
The index of the shell the edge belongs to.

Tekla.Structures.Solid.Edge.#ctor(Tekla.Structures.Solid.Edge.EdgeTypeEnum,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Initializes a new instance of the Tekla.Structures.Solid.Edge class.
type: Type of the new edge.
startPoint: Start point of the new edge.
endPoint: End point of the new edge.

Tekla.Structures.Solid.Edge.#ctor(Tekla.Structures.Solid.Edge.EdgeTypeEnum,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Int32)
Initializes a new instance of the Tekla.Structures.Solid.Edge class.
type: Type of the new edge.
startPoint: Start point of the new edge.
endPoint: End point of the new edge.
shellIndex: The inde xof the shell the dge blongs to. -1 if unknown.

Tekla.Structures.Solid.Edge.Type
Gets the type of the edge.

Tekla.Structures.Solid.Edge.StartPoint
Gets the start point of the edge.

Tekla.Structures.Solid.Edge.EndPoint
Gets the end point of the edge.

Tekla.Structures.Solid.Edge.ShellIndex
Gets the shell index of the edge.

Tekla.Structures.Solid.Edge.Clone
Method for cloning the current object.
Returns: Cloned object.